[
    {
        "topic": "MEDICATIONS",
        "section_text": "Her list of medicines is as noted on 04/22/03.  There is a morning and evening lift.",
        "dialogue": " \nDoctor: Can you tell me what medications you are taking?\r\nPatient: I have a morning and evening dose. \r\nDoctor: Can you tell me what they are? \r\nPatient: They are the same as what I was taking on 04/22/03. \r\nDoctor: Alright, thank you. \n",
        "most_similar_instructions": {
            "Doctor: Can you tell me what are the diseases you have been diagnosed with in the past? \r\nPatient: Sure, I have had hypertension, diabetes, asthma and cholesterol problem.\r\nDoctor: Ok, is there anything else?\r\nPatient: Nope.\r\nDoctor: And it is type two diabetes, right?\r\nPatient: Yes.\r\nDoctor: Thank you!": 0.3440860215053763,
            "Doctor: How are you?\r\nPatient: I am good.\r\nDoctor: That's great. You are stable.\r\nPatient: Can I go home now?\r\nDoctor: Yes, you can.\r\nPatient: Thank you!": 0.33333333333333326,
            "Doctor: Hey, what's going on with you today?\r\nPatient: Oh, I have a chest pain.\r\nDoctor: You have fever too?\r\nPatient: Yes, I did.": 0.31884057971014496,
            "Doctor: How are you Mister James?\r\nPatient: I have been better!\r\nDoctor: Oh, tell me what's going on with you?\r\nPatient: I have this leg pain on my left side. \r\nDoctor: Hm, left leg pain?\r\nPatient: Yeah.": 0.3170731707317074,
            "Doctor: What are some medications you are on?\r\nPatient: I am on pain pills.\r\nDoctor: Do you know their names?\r\nPatient: Yes. Oxycontin and Vicodin.\r\nDoctor: Okay that helps.": 0.3013698630136986,
            "Doctor: Can you tell me about your Immunizations?\r\nPatient: Yeah, I had them all. \r\nDoctor: Good, looks like you are up to date.": 0.2985074626865672,
            "Doctor: What medications are you currently taking? \r\nPatient: I am a diabetic, so I take Insulin. \r\nDoctor: How much Insulin do you take? \r\nPatient: It varies from day to day.": 0.29729729729729726,
            "Doctor:  Can you tell me what problems you have had in the past. Or what medical issues are currently going on?\r\nPatient: You mean my heart problem and things?\r\nDoctor: Yes.\r\nPatient: Okay, I have hypertension and kidney problems since many years.\r\nDoctor: Okay.\r\nPatient: I get frequent urinary infections.\r\nDoctor: Your urine creatinine is normal.\r\nPatient: Okay. I also have severe aortic stenosis.": 0.2962962962962963,
            "Doctor: What medications are you taking? \r\nPatient: I take Prilosec and Tramadol when I have back pain.": 0.29508196721311475,
            "Doctor: Well, I don't think you need any restraints as you are doing fine. I do want to make sure you have a chair and bed monitor since you have a history of multiple falls. They can help detect fall. \r\nPatient: I don't want that, I will manage. \r\nDoctor: Are you sure?\r\nPatient: Yes!": 0.28
        },
        "avg_similarity_score": 0.15712645972609532
    },
    {
        "topic": "ALLERGY",
        "section_text": "No allergies.",
        "dialogue": " \nDoctor: Hello there! How are you doing today? \r\nPatient: Hi! I am doing well, thank you. \r\nDoctor: I just wanted to ask if you have any allergies? \r\nPatient: No, I don't have any allergies. \r\nDoctor: Great to hear that. \n",
        "most_similar_instructions": {
            "Doctor: Hey, how are you?\r\nPatient: I think I am better.\r\nDoctor: So you do not have any more nausea or vomiting?\r\nPatient: No I don't.\r\nDoctor: How about any acidity?\r\nPatient: I think it's all better. \r\nDoctor: Great.": 0.4691358024691358,
            "Doctor: How are you today?\r\nPatient: I am good. \r\nDoctor: What is your past medical history? \r\nPatient: I don't have any health problems. Not yet at least. \r\nDoctor: Let's keep try to keep it that way. \r\nPatient: Yes please.": 0.4444444444444445,
            "Doctor: Are you allergic to anything?\r\nPatient: No, I do not have any allergies.\r\nDoctor: Great.": 0.4285714285714285,
            "Doctor: Hi there! How are doing today? \r\nPatient: I am doing well.  \r\nDoctor: How have you been doing with keeping your hemoglobin levels between four and five point six prercent? \r\nPatient: I have been doing well. I have been able to keep it within that range.": 0.4186046511627907,
            "Doctor: Good morning.  How are you feeling today? \r\nPatient: I feel good, considering.  I slept well last night.  \r\nDoctor: Are you expensing any pain or discomfort? \r\nPatient: No. I feel fine.": 0.3943661971830986,
            "Doctor: Hello, how are you?\r\nPatient: I am not so good. \r\nDoctor: Oh, what is going on with you? \r\nPatient: Well, I have lot of swelling in my legs.\r\nDoctor: Hm, okay.": 0.38888888888888884,
            "Doctor: How are you today? \r\nPatient: I am doing okay. \r\nDoctor: Do you have any medical conditions? \r\nPatient: I have diabetes. \r\nDoctor: When were you diagnosed with diabetes? \r\nPatient: It was two thousand and three, I think. I also have high blood pressure, asthma and high cholesterol. \r\nDoctor: Okay.": 0.38202247191011235,
            "Doctor: Hi there! Welcome in, sir. \r\nPatient: Hi! Thank you. \r\nDoctor: What is your past medical history? \r\nPatient: No. I don't have any health problems. \r\nDoctor: Do you have a primary care doctor? \r\nPatient: No. I don't have health insurance right now.": 0.380952380952381,
            "Doctor:  Are you allergic to anything?\r\nPatient: No, I am not.\r\nDoctor: How about food allergies.\r\nPatient: No, I am fine.\r\nDoctor: Okay.": 0.38095238095238093,
            "Doctor: Hello, how are you?\r\nPatient: Hi Doctor, I am good.\r\nDoctor: So, what is going on with you? \r\nPatient: Well, I am having nausea and I just want to get it checked.\r\nDoctor: Okay.": 0.3733333333333333
        },
        "avg_similarity_score": 0.18477286593434547
    },
    {
        "topic": "assessment",
        "section_text": "Assessment:    Sedated on Propofol gtts, but somewhat agitated, and tachypneic at    times.    CRRT active.    Pt arousable to speech, following commands, moving all extremities,    attempting to speak.    Remains intubated and ventilated on cpap 40% 5/5.    Lungs rhonchorous and diminished at bases, oxygenating well.    Bowel sounds hypoactive, OGT in place.    Moderate amount bloody oozing from incision, and cvl site.    Glucose 276 @ 2100.    Plts 58 @ 2100.    ",
        "dialogue": " \nDoctor: How are you feeling today?\r\nPatient: I'm feeling really groggy and out of it.\r\nDoctor: That's because we have you sedated on Propofol. But you're still a bit agitated, and your breathing is fast at times.\r\nPatient: I can still move and talk though.\r\nDoctor: Yes, you're still following commands and moving all your limbs. But we still have you intubated and ventilated on cpap 40% 5/5. Your lungs sound a bit strange, but you're still getting enough oxygen. You're also experiencing some hypoactive bowel sounds, and we have an OGT in place. You're bleeding a bit from your incision and cvl site, but it's a moderate amount. Your glucose levels are at 276 and your platelets are at 58.\r\nPatient: Oh wow, that's a lot to take in. What does it all mean?\n",
        "most_similar_instructions": {
            "Doctor: How are you feeling today, ma'am? \r\nPatient: Honestly, overall, I'm feeling a lot better. \r\nDoctor: Are you still having the diarrhea and decreased appetite? \r\nPatient: Yes, but I'm still feeling better though. \r\nDoctor: Have you been peeing a normal amount? \r\nPatient: Yeah, no problems there. I measured it like you told me to—six hundred M L. \r\nDoctor: When was the last time you peed? \r\nPatient: Um, it was about seven this morning.\r\nDoctor: Are you having any fever symptoms? \r\nPatient: No, I feel pretty well.": 0.22978723404255322,
            "Doctor: Hello. Are you ready for your surgery today? \r\nPatient: I'm ready as can be. This isn't my first rodeo. \r\nDoctor: I see. Have you had surgeries before? \r\nPatient: Yeah, I have. I think it's in my report that you have with you. \r\nDoctor: You're right. It says here you've had some stripping of veins in your legs, a tonsillectomy, and a adenoidectomy.": 0.22535211267605637,
            "Doctor: How are you feeling today?\r\nPatient: I have a lot of anxiety.\r\nDoctor: Anything else?\r\nPatient: I have a lot of pain in my chest as well.\r\nDoctor: Do you drink?\r\nPatient: Yes, I cannot stop myself. I have tried many times but it's hard to control.": 0.20618556701030924,
            "Doctor: Hi again! How are you feeling today?\r\nPatient: I am feeling okay. \r\nDoctor: Are you still experiencing any nausea or vomiting? \r\nPatient: No. I feel better now. \r\nDoctor: Have you had any shortness of breath or chest pain? \r\nPatient: No. \r\nDoctor: Any painful or burning urination? \r\nPatient: No. \r\nDoctor: Do you have a history of any seizure disorder? \r\nPatient: No.": 0.2038834951456311,
            "Doctor: Are you married? \r\nPatient: I'm divorced. \r\nDoctor: So, do you live alone? Or do you have kids? \r\nPatient: I live with my girlfriend, and we have a kid together. I also have three other kids from my former wife. \r\nDoctor: Do you smoke? \r\nPatient: I used to smoke. But I, I've quit like fifteen years ago. \r\nDoctor: What about alcohol? \r\nPatient: Yeah, I drink beer. Around one to two beers a day. \r\nDoctor: Are you working? \r\nPatient: I'm retired right now, but I used to work in an iron company.": 0.200836820083682,
            "Doctor: Hi there, sir! How are you doing today? \r\nPatient: I feel out of it. \r\nDoctor: Have you been using any substances? \r\nPatient: I did a little heroin and some coke earlier today. I still feel high. \r\nDoctor: Okay. Any shortness of breath, chest pain, abdominal pain or back pain?\r\nPatient: No. \r\nDoctor: Are you having any headaches, hallucinations or visual disturbances? \r\nPatient: No. \r\nDoctor: Do you have any open sores or wounds? \r\nPatient: No.": 0.2,
            "Doctor: How are you feeling today?  \r\nPatient: I am doing good, considering.  \r\nDoctor: Are you sleeping well?  \r\nPatient: Yes.  I was able to get some good sleep last night.   \r\nDoctor: Have you been able to eat without any trouble?  \r\nPatient: Yes. I ate a little bit of breakfast this morning.  \r\nDoctor: Have you been able to have a bowel movement yet?  \r\nPatient: Yes, I did this morning.  \r\nDoctor: Did you experience any difficulties with your movement?  \r\nPatient: It was still a little difficult and hard.  \r\nDoctor: Okay. Continue the high fiber diet that we discussed, and it should improve. Please let me or one of the nurses know if it has not improved or becomes worse.": 0.19923371647509577,
            "Doctor: Congratulations on your new baby! How are you doing today?\r\nPatient: I'm doing well, no headaches, and I'm breastfeeding well. \r\nDoctor: Have you had any bleeding?\r\nPatient: Nope, none. \r\nDoctor: Are you using a mini pad?\r\nPatient: Yeah, I use it twice a day. \r\nDoctor: Do you have any cramping or clotting? \r\nPatient: No, thankfully I don't. \r\nDoctor: What color is your discharge, ma'am? \r\nPatient: Well, its turned from red to brown, and now its kind of yellowish. \r\nDoctor: Okay, have you had sex again yet?\r\nPatient: No, we're waiting a little longer. \r\nDoctor: Are you going to the bathroom regularly? \r\nPatient: Regularly? Yes, but I'm having some pain with it, and then every once in a while I have some bright red bleeding. \r\nDoctor: Are you constipated?\r\nPatient: No, I'm not. \r\nGuest_family: She hasn't been eating her vegetables like she should. \r\nDoctor: That'll also do it. \r\nPatient: Okay, well, my seasonal allergies are back too. \r\nDoctor: What symptoms do you have with your allergies? \r\nPatient: I get itchy watery eyes, a runny nose, I can't stop sneezing, and I have a lot of pressure in my ears.": 0.19710144927536233,
            "Doctor: How're you doing today? \r\nPatient: Overall, pretty good. \r\nDoctor: Any plans for the weekend? \r\nPatient: No, not really. Just dog sitting my friend's golden. \r\nDoctor: Gotcha. That's still nice. We used to have a golden when I was a kid. They're the sweetest dogs. \r\nPatient: They are very sweet. \r\nDoctor: Okay, so you're in for a follow up for your neck and back pain. \r\nPatient: Yessir.  \r\nDoctor: Have you been going to pain management? \r\nPatient: Yeah, I go once every week or so.  \r\nDoctor: How's your pain now? \r\nPatient: Manageable, I guess.  \r\nDoctor: Is the pain still keeping you up at night? \r\nPatient: Not like it used to.  \r\nDoctor: Good, great to hear.": 0.1962264150943396,
            "Doctor: Hi there! How are you today? \r\nPatient: Hi! I am good. \r\nDoctor: Welcome in! \r\nPatient: Thank you. \r\nDoctor: Lets start with a little social history. Are you a tobacco or alcohol user? \r\nPatient: No. \r\nDoctor: Are you married? Do you have children? \r\nPatient: I am not married but I do have a two year old son. \r\nDoctor: Do you currently see a gynecologist? \r\nPatient: Yes. She is in Bartow. \r\nDoctor: Great.": 0.19354838709677422
        },
        "avg_similarity_score": 0.11988199286840101
    },
    {
        "topic": "assessment",
        "section_text": "Assessment:    New diagnosis NHL w/ multiple points of metastisis.    ",
        "dialogue": " \nDoctor: So, the assessment shows that you have a new diagnosis of NHL with multiple points of metastasis. \r\nPatient: NHL? What's that? \r\nDoctor: It stands for Non-Hodgkin's Lymphoma. \r\nPatient: Oh, okay. So what does that mean? \r\nDoctor: It means that you have cancer in your lymphatic system, and it has spread to multiple points in your body. \r\nPatient: Oh, wow. So what do we do now? \r\nDoctor: We'll need to start treatment right away. We'll discuss the options in more detail at your next appointment. \r\nPatient: Okay, sounds good. \n",
        "most_similar_instructions": {
            "Doctor: Do you know of any family history of kyphosis? \r\nPatient: I'm sorry, what's that?\r\nDoctor: It has to do with rounding of the spine. Does anyone in your family have a rounded posture?\r\nPatient: Actually, yeah, my great grandmother had that, and my mom would talk about my second cousin, he had it too.": 0.2251655629139073,
            "Doctor: So, looks like you have stones in your C B D. I am not hundred percent sure but most likely its stones. \r\nPatient: C B D? \r\nDoctor: Yeah, short for common bile duct. It's a small tube like structure which connects your liver duct and gallbladder. \r\nPatient: Oh! \r\nDoctor: Yeah, and because of that you have inflammation in your gallbladder.\r\nPatient: Oh, I see.": 0.22499999999999998,
            "Doctor: I am looking at the list of your medication.\r\nPatient: Okay.\r\nDoctor: All I can see is Risperdal and Invega.\r\nPatient: I think that is correct.\r\nDoctor: Are you not taking anything else?\r\nPatient: Yes, I take some multivitamins, but do I need to mention it?\r\nDoctor: Yes, you should. We need to know everything.\r\nPatient: Okay.": 0.22368421052631576,
            "Doctor: Hello. How are you doing today? \r\nPatient: I want to get surgery on my leg. \r\nDoctor: Have you ever had a surgery. \r\nPatient: I did. Here's a list of them. \r\nDoctor: Looks like you had eye surgery, cataract surgery, and lumbar decompression, correct? \r\nPatient: Yeah. So, what options do I have for surgery? \r\nDoctor: I need to see what the problem is first.": 0.2138364779874214,
            "Doctor: I think you have a muscular strain. \r\nPatient: Yeah.\r\nDoctor: So right side shoulder strain and maybe a little bit of nerve compression.\r\nPatient: Oh really!\r\nDoctor: Maybe. I will do further evaluation and treatment.\r\nPatient: Okay.": 0.21212121212121215,
            "Doctor: Are you experiencing any headaches, or do you have any history of migraine?\r\nPatient: No. \r\nDoctor: Any temporary loss of consciousness? \r\nPatient: No.\r\nDoctor: Any feeling of being off balance or fainting?\r\nPatient: No.\r\nDoctor: Any continuous sound you may hear? \r\nPatient: No.\r\nDoctor: Okay so no tinnitus. Any mouth sores or ulcers? \r\nPatient: Um, no.\r\nDoctor: Do you notice any change in your voice, any hoarseness? \r\nPatient: No, nothing like that. \r\nDoctor: Did you notice any swelling in and around your mouth? \r\nPatient: No, I did not.\r\nDoctor: Any history of goiter or swelling of your thyroid gland? \r\nPatient: Nope.\r\nDoctor: Okay.": 0.21212121212121213,
            "Doctor: How're you doing today? \r\nPatient: Overall, pretty good. \r\nDoctor: Any plans for the weekend? \r\nPatient: No, not really. Just dog sitting my friend's golden. \r\nDoctor: Gotcha. That's still nice. We used to have a golden when I was a kid. They're the sweetest dogs. \r\nPatient: They are very sweet. \r\nDoctor: Okay, so you're in for a follow up for your neck and back pain. \r\nPatient: Yessir.  \r\nDoctor: Have you been going to pain management? \r\nPatient: Yeah, I go once every week or so.  \r\nDoctor: How's your pain now? \r\nPatient: Manageable, I guess.  \r\nDoctor: Is the pain still keeping you up at night? \r\nPatient: Not like it used to.  \r\nDoctor: Good, great to hear.": 0.205607476635514,
            "Doctor: Do you have a family history of neurological conditions that I should know about? \r\nPatient: What exactly do you mean by that, doctor? \r\nDoctor: Well, it could be anything from A D H D, to epilepsy, to Alzheimer's. \r\nPatient: Oh, no.": 0.20437956204379562,
            "Doctor: I want to go over your medical history. I see here you saw the dermatologist a month ago.\r\nPatient: Yeah. She said that I um have an overactive sweat gland.  \r\nDoctor: Does hidradenitis suppurativa sound familiar? \r\nPatient: It does. \r\nDoctor: I ask because it's also included in your last visit with your dermatologist. \r\nPatient: Those are the red bumps, right? \r\nDoctor: Yes. There's a note here that you could've potentially had Staph with it as well. \r\nPatient: Oh yeah. I've also had a lot of abscesses in the past.  \r\nDoctor: It looks like you've had them in your upper mid thigh, vulva area, and the area between your vulva and anus. \r\nPatient: For about two years now. \r\nDoctor: Right. And a history of asthma? \r\nPatient: Correct.": 0.20353982300884954,
            "Doctor: Hi there, so you are here for your follow up?\r\nPatient: Yes, I had a surgical removal of multiple abscesses on my right thigh. \r\nDoctor: Okay, let me quickly check your discharge sheet.\r\nPatient: Sure. \r\nDoctor: It says you had multiple extensive subcutaneous abscesses on your right thigh and there was a massive open wound as well.\r\nPatient: Yes, that sounds about right! \r\nDoctor: Okay, and then they did multiple abscesses excisions on your thigh.\r\nPatient: Yes, on my right thigh.\r\nDoctor: Okay.": 0.20224719101123598
        },
        "avg_similarity_score": 0.12958771046473808
    }
]