[
    {
        "topic": "plan",
        "section_text": "Plan:    Check w/MD re: increasing lopressor. ",
        "dialogue": " \nPatient: I was wondering if I should increase my medication. \r\nDoctor: Sure, let me check with your MD.\n",
        "most_similar_instructions": {
            "Doctor: How are you feeling today? \r\nPatient: I have been having some trouble breathing.  I had tightness in my chest after walking up stairs. \r\nDoctor: Let me listen to your lungs.": 0.32653061224489793,
            "Patient: I think I got some allergy, my lips are swollen and its causing me difficulty in swallowing. \r\nDoctor: Oh, let me take a look.": 0.32558139534883723,
            "Doctor: Any known allergies?\r\nPatient: Oh yes, I cannot take Sulfa drugs.\r\nDoctor: Let me add that to your record.": 0.3157894736842105,
            "Doctor:  Are you talking any medications?\r\nPatient: No, I don't believe in meds.\r\nDoctor: Oh really, let me check your list.\r\nPatient: Yeah never.\r\nDoctor: Wow amazing.": 0.30434782608695654,
            "Doctor: Do you want to go home?\r\nPatient: Yes, I do. Can I?\r\nDoctor: Yes, you sure can.": 0.2777777777777778,
            "Doctor: What is your family medical history?  \r\nPatient: I was adopted.  I don't know my family medical history.": 0.27027027027027023,
            "Doctor: Hi there, what's going on with you? \r\nPatient: Well, I am having this weird jerky movement in my arm and leg. \r\nDoctor: Oh okay, let me take a look.": 0.24489795918367346,
            "Doctor: On April twenty two four we went over your list of medication and allergies.\r\nPatient: Okay.\r\nDoctor: Let me check something.\r\nPatient: Sure.": 0.2380952380952381,
            "Doctor: Do you drink or smoke? \r\nPatient: No I don't. I have to care for my daughter. She is a widow. \r\nDoctor: So you live with her?\r\nPatient: Yes, she lives at home.": 0.23076923076923078,
            "Doctor: I do not feel any swellings in your neck or groin area. \r\nPatient: Oh yeah, I don't notice anything either.\r\nDoctor: Okay yeah, I was just trying to look for any lymph nodes.\r\nPatient: Okay.\r\nDoctor: Let me check.\r\nPatient: Sure.": 0.2295081967213115
        },
        "avg_similarity_score": 0.09592879781813662
    },
    {
        "topic": "assessment",
        "section_text": "Assessment:    ",
        "dialogue": " \nDoctor: So, the assessment came back and it looks like you have high blood pressure.\nPatient: High blood pressure? What does that mean?\nDoctor: It means that your blood is putting too much pressure on your arteries and it can lead to some serious health problems. We'll need to start you on some medication to help lower it.\nPatient: Oh, okay. Is there anything else I can do to help?\nDoctor: Yes, eating a healthy diet and exercising regularly can help a lot. I'll give you some more information on that. \n",
        "most_similar_instructions": {
            "Doctor: It looks like your Xrays show bronchitis.  \r\nPatient: Is there anything I can take for it? \r\nDoctor: Yes, I'm going to prescribe you something that will help clear your lungs.": 0.256,
            "Doctor: Do you have any significant medical conditions in your history that I should know about? \r\nPatient: What, like high blood pressure? \r\nDoctor: Well, it could be anything from high blood pressure, to depression, to something as serious as cancer. \r\nPatient: Oh, no, I don't have anything like that, at least not that I know if.": 0.22666666666666668,
            "Doctor: Do you have any chronic medical conditions that I should know about? \r\nPatient: What do you mean by that, doctor? \r\nDoctor: Well, it could be anything from high blood pressure, to depression, to cancer. Do any of those sound familiar? \r\nPatient: Oh, yeah, I have a few things like that. I have anemia, high cholesterol, and, um, hypothyroidism.": 0.2236842105263158,
            "Doctor: Any medical history? \r\nPatient: Um I suffer from depression and high blood pressure. \r\nDoctor: Are you taking anything for either? \r\nPatient: Only for high blood pressure. \r\nDoctor: Have you had surgeries in the past? \r\nPatient: I had surgery to get a few hemorrhoids removed back in two thousand and ten.": 0.22222222222222224,
            "Doctor: Well, looking at your hand x ray, the bone looks in alignment, and I don't see any effusion.\r\nDoctor: Any tenderness or pain?\r\nPatient: Ah, not really!\r\nDoctor: There is no asymmetry. Can you move your hand up and down? Now rotate it. Can you move your fingers? \r\nPatient: Yes, I can do all of that, no problem at all.\r\nDoctor: Can you bend your hand?\r\nPatient: Yes.\r\nDoctor: Perfect.": 0.21818181818181817,
            "Doctor: Okay, so it looks like your blood work shows that your sodium levels are very low. This could explain some of the symptoms you've been having lately. \r\nPatient: What does that mean? Why are my sodium levels so low? \r\nDoctor: It could be due to a number of- \r\nPatient: Should I start eating more salt? \r\nDoctor: Not necessarily. But I believe it's partly due to the diuretic that you've been taking these past few weeks. Your blood work also shows anemia. I'd like to start you on some iron supplements for now and get you back in for another eval. The front desk has access to your orders and they can print you out a lab slip. \r\nPatient: Do you think the iron will help with my tiredness? I've been so exhausted and caffeine hasn't been helping one bit.": 0.2175732217573222,
            "Doctor: I am looking at the list of your medication.\r\nPatient: Okay.\r\nDoctor: All I can see is Risperdal and Invega.\r\nPatient: I think that is correct.\r\nDoctor: Are you not taking anything else?\r\nPatient: Yes, I take some multivitamins, but do I need to mention it?\r\nDoctor: Yes, you should. We need to know everything.\r\nPatient: Okay.": 0.21192052980132453,
            "Doctor: Do you have sugar or blood pressure problems?\r\nPatient: Oh, I have high blood pressure but it's well under control. I make sure to keep it under normal range.\r\nDoctor: Good. Any other health issues?\r\nPatient: Yeah, I have history of high triglycerides. But otherwise, I am pretty healthy. \r\nDoctor: Okay. Do you smoke?\r\nPatient: No.": 0.21192052980132453,
            "Doctor: So, you are a cigarette smoker? \r\nPatient: Yeah. \r\nDoctor: How much do you some? \r\nPatient: Not as much as some people. \r\nDoctor: How much is that exactly? \r\nPatient: Well, I probably buy a new pack once a week. \r\nDoctor: Okay. So that is about four packs a month and fifty packs a year. \r\nPatient: Yeah, I guess so.": 0.2105263157894737,
            "Doctor: It looks like he has a history of high blood pressure, high cholesterol, and Afib. \r\nGuest_clinician: Does he see a cardiologist for his Afib? \r\nDoctor: Not according to his chart. I'll see if I can call his emergency contact to confirm.\r\nGuest_clinician: Okay. Keep me posted.": 0.2097902097902098
        },
        "avg_similarity_score": 0.12744014745433183
    }
]